In [1]:
library(dplyr)

Warning message:
"package 'dplyr' was built under R version 3.6.3"
Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [2]:
head(mutate(mtcars, disp_l = disp / 61.0237), 3)

              mpg  cyl disp hp  drat wt    qsec  vs am gear carb disp_l
Mazda RX4     21.0 6   160  110 3.90 2.620 16.46 0  1  4    4    2.621932
Mazda RX4 Wag 21.0 6   160  110 3.90 2.875 17.02 0  1  4    4    2.621932
Datsun 710    22.8 4   108   93 3.85 2.320 18.61 1  1  4    1    1.769804

In [3]:
x <- 10
ifelse(x > 9, "x is greater than 9", "x is not greater than 9")

[1] "x is greater than 9"

In [4]:
section <- c("MATH111", "MATH111", "ENG111")
grade <- c(78, 93, 56)
student <- c("David", "Kristina", "Mycroft")
gradebook <- data.frame(section, grade, student)
mutate(gradebook, Pass.Fail = ifelse(grade > 60, "Pass", "Fail"))

  section grade student  Pass.Fail
1 MATH111 78    David    Pass
2 MATH111 93    Kristina Pass
3 ENG111  56    Mycroft  Fail

In [5]:
mutate(gradebook, letter = ifelse(grade %in% 60:69, "D",
                                     ifelse(grade %in% 70:79, "C",
                                            ifelse(grade %in% 80:89, "B",
                                                   ifelse(grade %in% 90:99, "A", "F")))))

  section grade student  letter
1 MATH111 78    David    C
2 MATH111 93    Kristina A
3 ENG111  56    Mycroft  F

In [6]:
mutate(gradebook, letter = ifelse(grade %in% 60:69, "D",
                                     ifelse(grade %in% 70:79, "C",
                                            ifelse(grade %in% 80:89, "B",
                                                   ifelse(grade %in% 90:99, "A", "F")))))

  section grade student  letter
1 MATH111 78    David    C
2 MATH111 93    Kristina A
3 ENG111  56    Mycroft  F

In [7]:
grepl("MATH", gradebook$section)

[1]  TRUE  TRUE FALSE

In [8]:
mutate(gradebook, department = ifelse(grepl("MATH", section), "Math Department",
                                      ifelse(grepl("ENG", section), "English Department", "Other")))

  section grade student  department
1 MATH111 78    David    Math Department
2 MATH111 93    Kristina Math Department
3 ENG111  56    Mycroft  English Department